posts/three-minute-thesis.org
#+TITLE: Have you ever packaged anything?
#+DATE: <2019-03-12 19:29>
#+AUTHOR: Musa Al-hassy
#+EMAIL: alhassy@gmail.com
#+fileimage: packages.png 250 250
#+filetags: packages dependent-types

* Abstract        :noexport:here_only_for_index_html:
  :PROPERTIES:
  :CUSTOM_ID: Abstract
  :END:

#+TOC: headlines 2

# copied from the repo

Herein I try to make my current doctoral research accessible to the average person:
Extending dependently-typed languages to implement module system features in the core
language. It's something I can direct my family to, if they're inclined to know what it is
I've been doing lately.

The technical matter can be seen at the associated website
─[[https://alhassy.github.io/next-700-module-systems-proposal/][The Next 700 Module Systems]]─ which includes a poster, slides, and a demo.

Excluding the abstract, this is my thesis proposal in /three minutes/ (•̀ᴗ•́)و

* Content :ignore:

#+macro: fold #+begin_details
#+macro: end-fold #+end_details
#+macro: comment #+begin_comment
#+macro: end-comment #+end_comment

#+include: ~/thesis-proposal/proposal/three_minutes.org
